app/controllers/joy_ride_funs_controller.rb

  def index
    @joy_ride_funs = JoyRideFun.all
---
SELECT "joy_ride_funs".* FROM "joy_ride_funs"

  def create
    @joy_ride_fun = JoyRideFun.new(joy_ride_fun_params)

    if @joy_ride_fun.save
---
INSERT INTO "joy_ride_funs" ("name", "image", "location", "comments", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Dr. Adams"], ["image", ""], ["location", "San Francisco"], ["comments", "Dope"], ["created_at", "2019-06-04 21:17:17.958227"], ["updated_at", "2019-06-04 21:17:17.958227"]]

    def set_joy_ride_fun
      @joy_ride_fun = JoyRideFun.find(params[:id])
---
SELECT  "joy_ride_funs".* FROM "joy_ride_funs" WHERE "joy_ride_funs"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]